import numpy as np


def progonka(a, b, c, d):
  """
  Решает СЛАУ с трёхдиагональной матрицей методом прогонки

  Параметры:
  :param a: Элементы под главной диагональю (коэффициенты при x[i-1] в i-м уравнении, i = 1..n-1).
  :param b: Элементы на главной диагонали (коэффициенты при x[i] в i-м уравнении).
  :param c: Элементы над главной диагональю (коэффициенты при x[i+1] в i-м уравнении, i = 0..n-2).
  :param d: Вектор правых частей системы.

  поскольку матрица трехдиагональная, то мы можем выразить в каждой строке i-й элемент через i+1-й 
  """
  n = len(d)
  P = np.zeros(n-1)  
  Q = np.zeros(n)    
  
  P[0] = -c[0] / b[0]
  Q[0] = d[0] / b[0]
  
  for i in range(1, n-1):
    P[i] = -c[i] / (b[i] + a[i - 1] * P[i - 1])
    Q[i] = (d[i] - a[i - 1] * Q[i - 1]) / (b[i] + a[i - 1] * P[i - 1])

  Q[n - 1] = (d[n - 1] - a[n - 2] * Q[n - 2]) / (b[n - 1] + a[n - 2] * P[n - 2])

  x = np.zeros(n)
  x[n - 1] = Q[n - 1]
  for i in range(n - 2, -1, -1):
    x[i] = Q[i] + P[i] * x[i + 1]
  
  return x

#  7  -5  0  0   0 | 38 
# -6  19 -9  0   0 | 14
#  0   6 -18 7   0 | -45
#  0   0 -7 -11 -2 | 30
#  0   0  0  5  -7 | 48
a = np.array([-6, 6, -7, 5])
b = np.array([7, 19, -18, -11, -7])
c = np.array([-5, -9, 7, -2])
d = np.array([38, 14, -45, 30, 48])
x = progonka(a, b, c, d)

print("Решение системы:", x)
